Revit 2027 API
FabricArea.GetReinforcementRoundingManager Method
 Returns an object for managing reinforcement rounding override settings.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricRoundingManager GetReinforcementRoundingManager()
Public Function GetReinforcementRoundingManager As FabricRoundingManager
public:
FabricRoundingManager^ GetReinforcementRoundingManager()
member GetReinforcementRoundingManager : unit -> FabricRoundingManager
Return Value
FabricRoundingManager
 The rounding manager.
See Also
Reference
FabricArea Class
Autodesk.Revit.DB.Structure Namespace